// Створити списк або використати існуючий.
//  Реалізувати підсвічування елементів списку при кліку миші.
//   Використовавати event.target. Обробник onclick застоувати для списку,
//   а не для кожного елементу. Створити меню (кілька кнопок),
//   додати одни обробник для всього меню і атрибути data-* для кожної кнопки,
//    в відповідності з методами, які вони викликають. Застосувати прийом
//    проектування «Поведінка»
// (додавання елементам поведінки behavior за допомогою атрибута data-*.
